Catalogs/РегистрацииВНалоговомОргане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РегистрацииВНалоговомОргане</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность налогоплательщика на представителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоверенностиНалогоплательщика</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиФНС</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</v8:Type>
						<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПредставителя</Name>
					<Comment>Название документа, подтверждающего полномочия представителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИФНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Comment>Представитель в территориальном органе ФНС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УполномоченноеЛицоПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСлужебное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПостановкиНаУчет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСнятияСУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрупнейшийНалогоплательщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подписанты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доверенность</Name>
							<Comment>Доверенность налогоплательщика на представителя</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоверенностиНалогоплательщика</v8:Type>
								<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиФНС</v8:Type>
								<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</v8:Type>
								<v8:Type>cfg:CatalogRef.МашиночитаемыеДоверенности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УполномоченноеЛицоПредставителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПредставителя</Name>
							<Comment>Название документа, подтверждающего полномочия представителя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РегистрацииВНалоговомОргане/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет значением по умолчанию код региона
//
Процедура ЗаполнитьКодРегиона() Экспорт
	
	Если ЗначениеЗаполнено(КодРегиона) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Код) Тогда
		Возврат;
	КонецЕсли;
	
	КодРегиона = ДанныеГосударственныхОрганов.КодРегионаПоКодуНалоговогоОргана(Код);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
	
		ДанныеЗаполнения = Новый Структура("Владелец");
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И (НЕ ДанныеЗаполнения.Свойство("Владелец")
			ИЛИ НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Владелец)) Тогда
		
		ДанныеЗаполнения.Вставить("Владелец", РегламентированнаяОтчетность.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"))
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И (НЕ ДанныеЗаполнения.Свойство("КПП")
			ИЛИ НЕ ЗначениеЗаполнено(ДанныеЗаполнения.КПП)) Тогда
			
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Владелец)
			И ТипЗнч(ДанныеЗаполнения.Владелец) = Тип("СправочникСсылка.Организации") 
			И ДанныеЗаполнения.Владелец.Метаданные().Реквизиты.Найти("КПП") <> Неопределено Тогда
			
			ДанныеЗаполнения.Вставить("КПП", ДанныеЗаполнения.Владелец.КПП);
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И (НЕ ДанныеЗаполнения.Свойство("Код")
			ИЛИ НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Код)) Тогда
			
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Владелец)
			И ТипЗнч(ДанныеЗаполнения.Владелец) = Тип("СправочникСсылка.Организации")
			И ДанныеЗаполнения.Владелец.Метаданные().Реквизиты.Найти("КПП") <> Неопределено Тогда
			
			ДанныеЗаполнения.Вставить("Код", Лев(СокрЛ(ДанныеЗаполнения.Владелец.КПП), 4));
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
			
	Если НЕ РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Владелец) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КПП");
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Код) И СтрДлина(СокрЛП(Код)) <> 4 Тогда
		ТекстСообщения = "Поле ""Код налогового органа"" должно состоять из 4-х цифр.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Код", , Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КПП) И СтрДлина(СокрЛП(КПП)) <> 9 Тогда
		ТекстСообщения = "Поле ""КПП"" должно состоять из 9-ти символов.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.КПП", , Отказ);
	КонецЕсли;
		
	РегламентированнаяОтчетность.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	флЭтоПБОЮЛ = НЕ РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Владелец);
	
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = НаименованиеИФНС;
	КонецЕсли;
	
	Если флЭтоПБОЮЛ Тогда
		КПП = "";
	КонецЕсли;
	
	Проверять = Истина;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСерверПереопределяемый.ПроверятьУникальностьРегистрацииВНалоговомОргане(Проверять);
	
	Если Проверять И Не ПометкаУдаления Тогда
	
		СуществующаяЗапись = Справочники.РегистрацииВНалоговомОргане.ПолучитьПоКодамРегистрациюВИФНС(Ссылка, Владелец, Код, КПП, КодПоОКТМО, Неопределено);
		
		Если СуществующаяЗапись <> Неопределено Тогда
			
			РегламентированнаяОтчетностьКлиентСервер.СообщитьОбОшибке(НСтр("ru = 'Для данной организации уже существует запись с указанными кодом налогового органа'") 
															+ ?(флЭтоПБОЮЛ, НСтр("ru = ' и ОКТМО.'"), НСтр("ru = ' и КПП.'")), Отказ);
		
			Сообщение = Новый СообщениеПользователю;
	
			Сообщение.Текст = НСтр("ru = 'Для данной организации уже существует запись с указанными кодом налогового органа'") 
							+ ?(флЭтоПБОЮЛ, НСтр("ru = ' и ОКТМО.'"), НСтр("ru = ' и КПП.'"));
	
			Сообщение.Сообщить();
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Представитель) Тогда
		ДокументПредставителя = "";
		УполномоченноеЛицоПредставителя = "";
	ИначеЕсли Метаданные.Справочники.Найти("ФизическиеЛица") <> Неопределено И ТипЗнч(Представитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда	
		УполномоченноеЛицоПредставителя = "";
	КонецЕсли;
	
	ЗаполнитьКодРегиона();
	
	Если НЕ ПустаяСтрока(НаименованиеОбособленногоПодразделения) Тогда
		НаименованиеСлужебное = НаименованиеОбособленногоПодразделения;
	ИначеЕсли ЭтоНовый() Тогда
		// При вводе новой регистрации из формы подразделения или организации используется метод УстановитьСсылкуНового()
		// Полученная таким образом ссылка на новую регистрацию устанавливается в поле объекта справочника подразделений/организаций при записи
		// В этом случае метод ПолучитьСсылкуНового() вернет ссылку, которая уже установлена в объекте, "вызвавшем" создание регистрации		
		НаименованиеСлужебное = Справочники.РегистрацииВНалоговомОргане.НаименованиеСлужебное(ПолучитьСсылкуНового());
	Иначе	
		НаименованиеСлужебное = Справочники.РегистрацииВНалоговомОргане.НаименованиеСлужебное(Ссылка);
	КонецЕсли;
	
	КрупнейшийНалогоплательщик =
		ИдентификационныеНомераНалогоплательщиков.ЭтоПричинаПостановкиНаУчетКрупнейшегоНалогоплательщика(
			ИдентификационныеНомераНалогоплательщиков.КодПричиныПостановкиНаУчет(КПП));
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Нужно привести КПП и код налогового органа организаций и подразделений текущего налогового органа
	// в соответствии с текущими значениями
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("РегистрацияВНалоговомОргане", Ссылка);
	Запрос.Параметры.Вставить("КПП", КПП);
	Запрос.Параметры.Вставить("КодНалоговогоОргана", Код);
	Запрос.Параметры.Вставить("НаименованиеИФНС", НаименованиеИФНС);
	Запрос.Параметры.Вставить("КрупнейшийНалогоплательщик", КрупнейшийНалогоплательщик);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане
	|	И (Организации.КПП <> &КПП
	|			ИЛИ Организации.КодНалоговогоОргана <> &КодНалоговогоОргана
	|			ИЛИ Организации.НаименованиеНалоговогоОргана <> &НаименованиеИФНС)
	|	И НЕ &КрупнейшийНалогоплательщик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Ссылка
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|ГДЕ
	|	ПодразделенияОрганизаций.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане
	|	И ПодразделенияОрганизаций.КПП <> &КПП
	|	И ПодразделенияОрганизаций.ОбособленноеПодразделение = ИСТИНА
	|	И НЕ &КрупнейшийНалогоплательщик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.КрупнейшийНалогоплательщикРегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане
	|	И (Организации.КрупнейшийНалогоплательщикКПП <> &КПП
	|			ИЛИ Организации.КодНалоговогоОрганаПолучателя <> &КодНалоговогоОргана
	|			ИЛИ Организации.КрупнейшийНалогоплательщикНаименованиеНалоговогоОргана <> &НаименованиеИФНС)
	|	И &КрупнейшийНалогоплательщик";
	
	Если КрупнейшийНалогоплательщик Тогда
		РеквизитыРегистрации = Новый Структура(
			"КрупнейшийНалогоплательщикКПП, КодНалоговогоОрганаПолучателя, КрупнейшийНалогоплательщикНаименованиеНалоговогоОргана",
			КПП, Код, НаименованиеИФНС);
	Иначе
		РеквизитыРегистрации = Новый Структура(
			"КПП, КодНалоговогоОргана, НаименованиеНалоговогоОргана",
			КПП, Код, НаименованиеИФНС);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбъектРегистрации = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ОбъектРегистрации, РеквизитыРегистрации);
		ОбъектРегистрации.Записать();
		
	КонецЦикла;
	
	// При наличии регистрации в г. Москве, показываем новости про торговый сбор
	КодыРегионовУплатыТорговогоСбора = ТорговыйСбор.КодыРегионовУплатыТорговогоСбора();
	КатегорияНовостей = ПланыВидовХарактеристик.КатегорииНовостей.НайтиПоКоду("TaxesAndFees");
	Если КодыРегионовУплатыТорговогоСбора.Найти(XMLСтрока(КодРегиона)) <> Неопределено 
		И Не ЗначениеЗаполнено(ДатаСнятияСУчета)
		И ЗначениеЗаполнено(КатегорияНовостей) Тогда
		
		// Устанавливаем отбор, только если он еще не задан
		ДанныеОтбора = Новый Структура;
		ДанныеОтбора.Вставить("КатегорияНовостей"        , КатегорияНовостей);
		ДанныеОтбора.Вставить("ЗначениеКатегорииНовостей", "ТорговыйСбор");
		
		ЗначенияОтборов = ОбработкаНовостей.ПолучитьПрограммноеЗначениеОтбора_ДляОбластиДанных(КатегорияНовостей);
		Если ЗначенияОтборов.НайтиСтроки(ДанныеОтбора).Количество() = 0 Тогда
			ЗначенияОтборов = ОбработкаНовостей.ЗначенияОтборов_ДляОбластиДанных(ДанныеОтбора);
			ОбработкаНовостей.ДобавитьПрограммноеЗначениеОтбора_ДляОбластиДанных(ЗначенияОтборов);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
